# MySQL 연결

In [1]:
# pip install pymysql

import pymysql

### useraddress schema에서 userinfo table 불러오기

In [2]:
# MySQL Connection

conn = pymysql.connect(host = "127.0.0.1", user = "root", password = "qwer1234", db = "education", charset = "utf8")

In [3]:
# Connection으로 부터 Cursor 생성

curs = conn.cursor()

In [4]:
# SQL문장

sql = "select * from student"
curs.execute(sql)

7

In [5]:
# Data Fetch

rows = curs.fetchall()
print(rows)

(('a001', 'James', 'math', '001', None), ('a002', 'cathy', 'math', '002', None), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None))

In [6]:
# Connection 종료

conn.close()

In [7]:
# list로 변환

rowsList = list(rows)
print(rowsList)

[('a001', 'James', 'math', '001', None), ('a002', 'cathy', 'math', '002', None), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None)]

In [8]:
# data type 확인

type(rowsList)

list

In [9]:
# 필요한 부분 데이터 빼오기

print(rowsList[0])
print(rowsList[0][1])

('a001', 'James', 'math', '001', None)
James

---
### Insert Data #1

In [10]:
# MySQL Connection

conn = pymysql.connect(host = "127.0.0.1", user = "root", password = "qwer1234", db = "education", charset = "utf8")

In [11]:
# Connection으로 부터 Cursor 생성

curs = conn.cursor()

In [12]:
# SQL문장

sql = "insert into student(scode, sname, sdept, sphone, saddress) values (%s, %s, %s, %s, %s)"

In [13]:
# Insert 실행

curs.execute(sql, ('b001', '유비', '국문학과', '010-111', '서울'))
curs.execute(sql, ('b002', '관우', '심리학과', '010-222', '서울'))
curs.execute(sql, ('b003', '장비', '경제학과', '010-333', '서울'))

1

In [14]:
conn.commit()

In [15]:
# SQL문장

sql = "select * from student"
curs.execute(sql)

10

In [16]:
# Data Fetch

rows = curs.fetchall()
print(rows)

(('a001', 'James', 'math', '001', None), ('a002', 'cathy', 'math', '002', None), ('b001', '유비', '국문학과', '010-111', '서울'), ('b002', '관우', '심리학과', '010-222', '서울'), ('b003', '장비', '경제학과', '010-333', '서울'), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None))

In [17]:
# Connection 종료

conn.close()

---
### Insert Data #2

In [18]:
# MySQL Connection

conn = pymysql.connect(host = "127.0.0.1", user = "root", password = "qwer1234", db = "education", charset = "utf8")
curs = conn.cursor()

In [19]:
# Data

data = (
    ('c001', '조조', '국문학과', '016-111', '경기'),
    ('c002', '여포', '심리학과', '016-222', '경기'),
    ('c003', '손견', '경제학과', '016-333', '경기'),
)

In [20]:
# SQL문장

sql = "insert into student(scode, sname, sdept, sphone, saddress) values (%s, %s, %s, %s, %s)"

In [21]:
# Insert 실행

curs.executemany(sql, data)

3

In [22]:
conn.commit()

In [23]:
# Select SQL

sql = "select * from student"
curs.execute(sql)

rows = curs.fetchall()
print(rows)

(('a001', 'James', 'math', '001', None), ('a002', 'cathy', 'math', '002', None), ('b001', '유비', '국문학과', '010-111', '서울'), ('b002', '관우', '심리학과', '010-222', '서울'), ('b003', '장비', '경제학과', '010-333', '서울'), ('c001', '조조', '국문학과', '016-111', '경기'), ('c002', '여포', '심리학과', '016-222', '경기'), ('c003', '손견', '경제학과', '016-333', '경기'), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None))

In [24]:
# Connection 종료

conn.close()

---
### Update Data

In [25]:
# MySQL Connection

conn = pymysql.connect(host = "127.0.0.1", user = "root", password = "qwer1234", db = "education", charset = "utf8")
curs = conn.cursor()

In [26]:
# SQL문장

sql = "update student set saddress = '인천' where scode = 'b001'"

In [27]:
# Update 실행

curs.execute(sql)

1

In [28]:
conn.commit()

In [29]:
# Select SQL

sql = "select * from student"
curs.execute(sql)

rows = curs.fetchall()
print(rows)

(('a001', 'James', 'math', '001', None), ('a002', 'cathy', 'math', '002', None), ('b001', '유비', '국문학과', '010-111', '인천'), ('b002', '관우', '심리학과', '010-222', '서울'), ('b003', '장비', '경제학과', '010-333', '서울'), ('c001', '조조', '국문학과', '016-111', '경기'), ('c002', '여포', '심리학과', '016-222', '경기'), ('c003', '손견', '경제학과', '016-333', '경기'), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None))

In [30]:
conn.close()

---
### Delete Data

In [31]:
# MySQL Connection

conn = pymysql.connect(host = "127.0.0.1", user = "root", password = "qwer1234", db = "education", charset = "utf8")
curs = conn.cursor()

In [32]:
# SQL문장

sql = "delete from student where scode=%s"

In [33]:
# Delete 실행

curs.execute(sql, 'b001')

1

In [34]:
conn.commit()

In [35]:
# Select SQL

sql = "select * from student"
curs.execute(sql)

rows = curs.fetchall()
print(rows)

(('a001', 'James', 'math', '001', None), ('a002', 'cathy', 'math', '002', None), ('b002', '관우', '심리학과', '010-222', '서울'), ('b003', '장비', '경제학과', '010-333', '서울'), ('c001', '조조', '국문학과', '016-111', '경기'), ('c002', '여포', '심리학과', '016-222', '경기'), ('c003', '손견', '경제학과', '016-333', '경기'), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None))

In [36]:
conn.close()

---
### insert후 select 하기

In [37]:
# MySQL Connection

conn = pymysql.connect(host = "127.0.0.1", user = "root", password = "qwer1234", db = "education", charset = "utf8")

In [38]:
try:
    # INSERT
    with conn.cursor() as curs:
        sql = """insert into student(scode, sname, sdept, sphone, saddress) 
        values (%s, %s, %s, %s, %s)"""
        curs.execute(sql, ('d001', '홍길동', '수학과', '017-001', '광주'))

    conn.commit()

    # SELECT
    with conn.cursor() as curs:
        sql = "select * FROM student"
        curs.execute(sql)
        rs = curs.fetchall()
        for row in rs:
            print(row)

finally:
    conn.close()

('a001', 'James', 'math', '001', None)
('a002', 'cathy', 'math', '002', None)
('b002', '관우', '심리학과', '010-222', '서울')
('b003', '장비', '경제학과', '010-333', '서울')
('c001', '조조', '국문학과', '016-111', '경기')
('c002', '여포', '심리학과', '016-222', '경기')
('c003', '손견', '경제학과', '016-333', '경기')
('d001', '홍길동', '수학과', '017-001', '광주')
('S001', '박소명', '컴퓨터공학과', '123-4567', None)
('S003', '이승호', '국문학과', '345-6789', None)
('S004', '정수봉', '국문학과', '456-7890', None)
('S005', '김상진', '사학과', '567-8901', None)
('S006', '황정숙', '사학과', '678-9012', None)

---
### select의 내용을 dataframe으로 보기

In [39]:
import pandas as pd
from sqlalchemy import create_engine # pip install sqlalchemy

In [40]:
engine = create_engine("mysql+pymysql://root:"+"qwer1234"+"@127.0.0.1:3306/education?", convert_unicode=True)
conn = engine.connect()

In [41]:
data = pd.read_sql_table('student', conn)
data

   scode  sname   sdept    sphone saddress
0   a001  James    math       001     None
1   a002  cathy    math       002     None
2   b002     관우    심리학과   010-222       서울
3   b003     장비    경제학과   010-333       서울
4   c001     조조    국문학과   016-111       경기
5   c002     여포    심리학과   016-222       경기
6   c003     손견    경제학과   016-333       경기
7   d001    홍길동     수학과   017-001       광주
8   S001    박소명  컴퓨터공학과  123-4567     None
9   S003    이승호    국문학과  345-6789     None
10  S004    정수봉    국문학과  456-7890     None
11  S005    김상진     사학과  567-8901     None
12  S006    황정숙     사학과  678-9012     None

In [42]:
conn.close()

---
### dataframe을 Database로 Insert하기

In [43]:
# useraddress schema에 daumlist[rank, title] Table 만들기

In [44]:
column = ['rank', 'title'] # Table의 이름과 맞추기
movies = pd.read_csv("../Data/DaumList.csv") # csv 읽어오기
movies.columns = column
movies.head()

   rank          title
0     1         럭키 몬스터
1     2             조제
2     3          썸머 85
3     4  극장판 바이올렛 에버가든
4     5           리플레이

In [45]:
engine = create_engine("mysql+pymysql://root:"+"qwer1234"+"@127.0.0.1:3306/education?", convert_unicode=True)
conn = engine.connect()

In [46]:
# movies.to_sql(name='테이블이름', con=engine, if_exists='append', index=False)
movies.to_sql(name='daumlist', con=engine, if_exists='append', index=False)